Revit 2024 API
FormattedText.SetItalicStatus Method (Boolean)
 Sets the characters in the entire text to be italic or not italic.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public void SetItalicStatus(
	bool isItalic
)
Visual Basic
Public Sub SetItalicStatus ( _
	isItalic As Boolean _
)
Visual C++
public:
void SetItalicStatus(
	bool isItalic
)
Parameters
isItalic
Type: System.Boolean
 The desired italic status of characters in the entire text. True to set italic, false to set not italic.
See Also
FormattedText Class
SetItalicStatus Overload
Autodesk.Revit.DB Namespace